tap "epk/epk"
tap "homebrew/services"
tap "knazarov/qemu-virgl"
tap "mongodb/brew"
tap "neovim/neovim"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Multi-shell multi-command argument completer
brew "carapace"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# Cross-platform make
brew "cmake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Low-level cryptographic library
brew "nettle"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Database migrations CLI tool
brew "golang-migrate"
# JPEG image codec that aids compression and decompression
brew "jpeg-turbo"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Run local Kubernetes cluster in Docker
brew "kind"
# Simple terminal UI for git commands
brew "lazygit"
# Library for manipulating PNG images
brew "libpng"
# Parsing Expression Grammars For Lua
brew "lpeg"
# Just-In-Time Compiler (JIT) for the Lua programming language
brew "luajit"
# Package manager for the Lua programming language
brew "luarocks"
# Bare libuv bindings for lua
brew "luv"
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# Simple tool to make locally trusted development certificates
brew "mkcert"
# Incremental parsing library
brew "tree-sitter"
# Very basic terminfo library
brew "unibilium"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim", args: ["HEAD"]
# Command-line interface for SQLite
brew "sqlite"
# Platform built on V8 to build network applications
brew "node"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Python version management
brew "pyenv"
# Interpreted, interactive, object-oriented programming language
brew "python@3.13"
# Python Language Server for the Language Server Protocol
brew "python-lsp-server"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Cross-shell prompt for astronauts
brew "starship"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Easiest, most secure way to use WireGuard and 2FA
brew "tailscale"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Markup-based typesetting system
brew "typst"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Desktop password and login vault
cask "bitwarden"
cask "font-hack"
cask "font-ibm-plex-mono"
cask "font-iosevka"
cask "font-meslo-lg-nerd-font"
cask "font-sf-mono-nerd-font"
cask "font-source-code-pro"
cask "font-symbols-only-nerd-font"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Free cross-platform office suite, fresh version
cask "libreoffice"
# Control your tools with a few keystrokes
cask "raycast"
# Messaging app with a focus on speed and security
cask "telegram"
# JDK from the Eclipse Foundation (Adoptium)
cask "temurin"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm@nightly"
vscode "aaronyoung.dark-synthwave-vscode"
vscode "alexcvzz.vscode-sqlite"
vscode "arcticicestudio.nord-visual-studio-code"
vscode "batisteo.vscode-django"
vscode "bibhasdn.django-snippets"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.githistory"
vscode "dunstontc.dark-plus-syntax"
vscode "eamodio.gitlens"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "golang.go"
vscode "huytd.nord-light"
vscode "janisdd.vscode-edit-csv"
vscode "junstyle.vscode-django-support"
vscode "llewellynpaintsil.legendary-dark"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "mtxr.sqltools"
vscode "mtxr.sqltools-driver-mysql"
vscode "muhammadsammy.flat-ui-dark"
vscode "nexxai.material-synthwave-vscode"
vscode "njpwerner.autodocstring"
vscode "pkief.material-icon-theme"
vscode "ritwickdey.liveserver"
vscode "robbowen.synthwave-vscode"
vscode "rust-lang.rust-analyzer"
vscode "sldobri.gruvbox-5-stars"
vscode "tamasfe.even-better-toml"
vscode "thekalinga.bootstrap4-vscode"
vscode "tucker.current-theme"
vscode "uloco.theme-bluloco-dark"
vscode "vscode-icons-team.vscode-icons"
vscode "xabikos.javascriptsnippets"
vscode "yummygum.city-lights-icon-vsc"
vscode "yzhang.markdown-all-in-one"
vscode "zhuangtongfa.material-theme"
go "github.com/air-verse/air"
go "github.com/btuckerc/anglbot"
go "github.com/golangci/golangci-lint/cmd/golangci-lint"
go "golang.org/x/tools/gopls"
go "github.com/golang-migrate/migrate/v4/cmd/migrate"
go "honnef.co/go/tools/cmd/staticcheck"
