tap "homebrew/services"
tap "mongodb/brew"
tap "neovim/neovim"
tap "epk/epk"

brew "bat"
brew "btop"
brew "carapace"
brew "chezmoi"
brew "cmake"
brew "coreutils"
brew "fd"
brew "fzf"
brew "gh"
brew "go"
brew "golang-migrate"
brew "jq"
brew "kind"
brew "lazygit"
brew "luarocks"
brew "mise"
brew "tree-sitter"
brew "neovim", args: ["HEAD"]
brew "sqlite"
brew "node"
brew "pyenv"
brew "python@3.13"
brew "python-lsp-server"
brew "ripgrep"
brew "starship"
brew "tmux"
brew "tree"
brew "typst"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

cask "font-ibm-plex-mono"
cask "font-sf-mono-nerd-font"
cask "font-source-code-pro"
cask "font-symbols-only-nerd-font"
cask "ghostty"
